src/Documents/ММ_ПланированиеТехнологическихРабот/ММ_ПланированиеТехнологическихРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ММ_ПланированиеТехнологическихРабот</name>
  <attributes>
    <name>ДатаНачалаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяРабота</name>
    <type>
      <types>EnumRef.ММ_ПланируемыеВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновляемаяБаза</name>
    <type>
      <types>CatalogRef.ММ_БазаДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматизацияОбновления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонУведомления</name>
    <type>
      <types>CatalogRef.ММ_ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьБазу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОбновляемыхРасширений</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.ММ_Расширения</types>
      </type>
    </attributes>
    <attributes>
      <name>Обновлять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбновления</name>
      <type>
        <types>EnumRef.ММ_СпособыОбновления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ММ_ПланируемыеВидыРабот/ММ_ПланируемыеВидыРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ММ_ПланируемыеВидыРабот</name>
  <enumValues>
    <name>Обновление</name>
  </enumValues>
  <enumValues>
    <name>ТехническоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ММ_ПланированиеТехнологическихРабот/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ДатаОкончанияРабот) И ДатаОкончанияРабот < ДатаНачалаРабот Тогда
		ОбщегоНазначения.СообщитьПользователю("Время окончания работ не может быть меньше времени начала работ",
			ЭтотОбъект, "ДатаОкончанияРабот", , Отказ);
	КонецЕсли;
	Если ПланируемаяРабота <> Перечисления.ММ_ПланируемыеВидыРабот.Обновление Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОбновляемаяБаза"));
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
#КонецЕсли
